# Assignment 2 (Week 2)


## Name: Theresa Louise Bazudde

In [1]:
%load_ext sql
%sql sqlite:///week_2.db

# Qs 1:

In [2]:
%%sql
SELECT c.name
FROM customers c
JOIN orders o
ON c.id = o.id
WHERE typeof(order_id) = 'null'

 * sqlite:///week_2.db
Done.

[('Afam',), ('Deborah',)]

## Part b

In [3]:
%%sql
SELECT id,
MAX(CASE WHEN store = 'store a' THEN price ELSE 0 END) AS 'store a',
MAX(CASE WHEN store = 'store b' THEN price ELSE 0 END) AS 'store b',
MAX(CASE WHEN store = 'store c' THEN price ELSE 0 END) AS 'store c'
FROM products 
GROUP BY id

 * sqlite:///week_2.db
Done.

[(0, 10, 11, 12), (1, 33, 35, 34)]

# Qs 2

## Part a

In [4]:
%%sql
SELECT e.name, e.salary, d.dept_name
FROM employee e
JOIN department d
ON d.id = e.dept_id
ORDER BY dept_name

 * sqlite:///week_2.db
Done.

[('Felix', 33000, 'IT'),
 ('Okafor', 25000, 'IT'),
 ('Gafar', 41000, 'IT'),
 ('Amanda', 53000, 'IT'),
 ('Steve', 32000, 'Sales'),
 ('Bola', 31000, 'Sales'),
 ('Babalola', 30200, 'Sales'),
 ('Adigun', 30000, 'Sales')]

## Part b

In [5]:
%%sql
SELECT e.name
FROM employee e
JOIN department d
ON d.id = e.dept_id
GROUP BY dept_name
HAVING MAX(salary)

 * sqlite:///week_2.db
Done.

[('Amanda',), ('Steve',)]

## Part C

In [6]:
%%sql
SELECT e.name, e.salary, d.dept_name
FROM employee e
JOIN department d
ON d.id = e.dept_id
EXCEPT 
SELECT e.name, e.salary, d.dept_name
FROM employee e
JOIN department d
ON d.id = e.dept_id
GROUP BY dept_name
HAVING MIN(salary)
ORDER BY dept_name, salary DESC

 * sqlite:///week_2.db
Done.

[('Amanda', 53000, 'IT'),
 ('Gafar', 41000, 'IT'),
 ('Felix', 33000, 'IT'),
 ('Steve', 32000, 'Sales'),
 ('Bola', 31000, 'Sales'),
 ('Babalola', 30200, 'Sales')]

# Qs 3

In [7]:
%%sql
SELECT * FROM students

 * sqlite:///week_2.db
Done.

[('ux-012-013', 'Emeka', 'M', 95, 84, 94),
 ('ux-012-014', 'Agnes', 'F', 80, 69, 88),
 ('ux-012-015', 'Alimat', 'F', 69, 69, 77),
 ('ux-012-017', 'Fred', 'M', 28, 57, 39),
 ('ux-012-018', 'Ogechi', 'F', 80, 69, 78),
 ('ux-012-019', 'Steve', 'M', 61, 69, 72),
 ('ux-012-016', 'Esther', 'F', 93, 77, 91),
 ('ux-012-020', 'Ahmed', 'M', 87, 94, 85),
 ('ux-012-021', 'Samantha', 'F', 52, 69, 48),
 ('ux-012-022', 'Philip', 'M', 51, 39, 45),
 ('ux-012-023', 'Dave', 'M', 77, 69, 70),
 ('ux-012-024', 'Seyi', 'M', 54, 83, 63)]

## Part a

In [8]:
%%sql
SELECT *, ROUND((maths+english+physics)/3, 2) percentage_score
FROM students
ORDER BY percentage_score

 * sqlite:///week_2.db
Done.

[('ux-012-017', 'Fred', 'M', 28, 57, 39, 41.0),
 ('ux-012-022', 'Philip', 'M', 51, 39, 45, 45.0),
 ('ux-012-021', 'Samantha', 'F', 52, 69, 48, 56.0),
 ('ux-012-024', 'Seyi', 'M', 54, 83, 63, 66.0),
 ('ux-012-019', 'Steve', 'M', 61, 69, 72, 67.0),
 ('ux-012-015', 'Alimat', 'F', 69, 69, 77, 71.0),
 ('ux-012-023', 'Dave', 'M', 77, 69, 70, 72.0),
 ('ux-012-018', 'Ogechi', 'F', 80, 69, 78, 75.0),
 ('ux-012-014', 'Agnes', 'F', 80, 69, 88, 79.0),
 ('ux-012-016', 'Esther', 'F', 93, 77, 91, 87.0),
 ('ux-012-020', 'Ahmed', 'M', 87, 94, 85, 88.0),
 ('ux-012-013', 'Emeka', 'M', 95, 84, 94, 91.0)]

## Part b

In [9]:
%%sql
SELECT *, ROUND((maths+english+physics)/3, 2) percentage_score
FROM students
WHERE percentage_score >
(SELECT AVG(ROUND((maths+english+physics)/3, 2))
FROM students)

 * sqlite:///week_2.db
Done.

[('ux-012-013', 'Emeka', 'M', 95, 84, 94, 91.0),
 ('ux-012-014', 'Agnes', 'F', 80, 69, 88, 79.0),
 ('ux-012-015', 'Alimat', 'F', 69, 69, 77, 71.0),
 ('ux-012-018', 'Ogechi', 'F', 80, 69, 78, 75.0),
 ('ux-012-016', 'Esther', 'F', 93, 77, 91, 87.0),
 ('ux-012-020', 'Ahmed', 'M', 87, 94, 85, 88.0),
 ('ux-012-023', 'Dave', 'M', 77, 69, 70, 72.0)]